АлогистикТест2/src/Documents/алк_УстановкаЦенНаЛесопродукцию/алк_УстановкаЦенНаЛесопродукцию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаЦенНаЛесопродукцию</name>
  <registerRecords>InformationRegister.алк_ЦеныНаЛесопродукциюТД</registerRecords>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Прейскурант</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Некондиция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.Градации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтанцияОтправления</name>
      <type>
        <types>CatalogRef.алк_ЛогистическиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспортировки</name>
      <type>
        <types>EnumRef.алк_ВидыТранспортировки</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_УстановкаЦенНаЛесопродукцию/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.СуммаВключаетНДС = Ложь;
		Объект.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
		
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	ПериодДействия.ДатаНачала    = Объект.ДатаС;
	ПериодДействия.ДатаОкончания = Объект.ДатаПо;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаС   = ПериодДействия.ДатаНачала;
	Объект.ДатаПо = ПериодДействия.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


&НаКлиенте
Процедура ПрейскурантЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Прейскурант.ТекущиеДанные;
	КонецЕсли;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
	СтрокаТабличнойЧасти.Цена - (СтрокаТабличнойЧасти.Цена) / ((СтавкаНДС + 100) / 100),
	СтрокаТабличнойЧасти.Цена * СтавкаНДС / 100);
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаКлиенте
Процедура ПрейскурантСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Прейскурант.ТекущиеДанные;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрейскурантСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Прейскурант.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);	
	
КонецПроцедуры
